## 01- How to find the version

In [2]:
import pandas as pd
pd.__version__

'2.3.3'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : 9c8bc3e55188c8aff37207a74f1dd144980b8874
python                : 3.13.5
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.26100
machine               : AMD64
processor             : Intel64 Family 6 Model 142 Stepping 10, GenuineIntel
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_United States.1252

pandas                : 2.3.3
numpy                 : 2.4.0
pytz                  : 2025.2
dateutil              : 2.9.0.post0
pip                   : 25.3
Cython                : None
sphinx                : None
IPython               : 9.8.0
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.14.3
blosc                 : None
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
html5lib              : None
hypothesis            : None
gcsfs                 : None
jinja2                : 3.1.6
lxml.etree            : None
matplotlib            : 3.10.8
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : 3.1.5
pandas_gbq            : None
psycopg2              : None
pymysql               : None
pyarrow               : None
pyreadstat            : None
pytest                : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
xlsxwriter            : None
zstandard             : None
tzdata                : 2025.2
qtpy                  : None
pyqt5                 : None

## 02- Make a dataframe

In [4]:
df = pd.DataFrame({'A col':[1,2,3],'B col':[4,5,6]})

In [5]:
df

   A col  B col
0      1      4
1      2      5
2      3      6

In [6]:
# numpy array use to create dataframe
import numpy as np
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])
# arr
df = pd.DataFrame(arr, columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
#numpy array dataframe
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.826649,0.452623,0.030530,0.717295,0.087704,0.316002,0.370030,0.192174
1,0.784449,0.826888,0.038368,0.576899,0.431495,0.948346,0.836417,0.959545
2,0.720433,0.147103,0.835563,0.328924,0.452020,0.807399,0.783515,0.450444
3,0.622797,0.661411,0.843754,0.913494,0.940451,0.778619,0.930236,0.791759

In [8]:
pd.DataFrame(np.random.rand(5,8), columns=['A','B','C','D','E','F','G','H'])

,A,B,C,D,E,F,G,H
0,0.784993,0.361394,0.792928,0.730846,0.092496,0.652166,0.921221,0.889677
1,0.453028,0.375802,0.718510,0.712060,0.017103,0.328257,0.800118,0.257365
2,0.851154,0.664630,0.339518,0.066977,0.545497,0.888641,0.057866,0.997545
3,0.284321,0.165338,0.459435,0.325775,0.124246,0.038745,0.795689,0.919234
4,0.007416,0.438045,0.838517,0.229882,0.931802,0.815304,0.355932,0.339678

# 03- How to rename columns

In [9]:
df = pd.DataFrame({'A col':[1,2,3,7,8,9],'B col':[4,5,6,10,11,12]})
df

   A col  B col
0      1      4
1      2      5
2      3      6
3      7     10
4      8     11
5      9     12

In [10]:
df.rename(columns={'A col':'Col_A', 'B col':'Col_B'}, inplace=True)
df

   Col_A  Col_B
0      1      4
1      2      5
2      3      6
3      7     10
4      8     11
5      9     12

In [ ]:
#Another method to rename columns
df.columns = ['col_AA', 'col_BB']
df

   col_AA  col_BB
0       1       4
1       2       5
2       3       6
3       7      10
4       8      11
5       9      12

In [14]:
# To replace any character, string
df.columns = df.columns.str.replace('_','-')
df

   col-AA  col-BB
0       1       4
1       2       5
2       3       6
3       7      10
4       8      11
5       9      12

In [17]:
# Adding prefix and suffix to column names
df = df.add_prefix('pre_').add_suffix('_suf')
df

   pre_col-AA_suf  pre_col-BB_suf
0               1               4
1               2               5
2               3               6
3               7              10
4               8              11
5               9              12

In [18]:
df.columns = ['A', 'B']
df

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12